#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.google_compute_image.os_image: Reading...
google_compute_router.nat_router[0]: Refreshing state... [id=projects/local-llm-test-486215/regions/us-central1/routers/llm-server-dev-nat-router]
google_compute_firewall.spot_instance[0]: Refreshing state... [id=projects/local-llm-test-486215/global/firewalls/llm-server-dev-firewall]
google_compute_router_nat.nat[0]: Refreshing state... [id=local-llm-test-486215/us-central1/llm-server-dev-nat-router/llm-server-dev-nat]
data.google_compute_image.os_image: Read complete after 1s [id=projects/debian-cloud/global/images/debian-12-bookworm-v20260114]
google_compute_instance.spot_instance: Refreshing state... [id=projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.spot_instance must be replaced
-/+ resource "google_compute_instance" "spot_instance" {
      ~ cpu_platform              = "Intel Cascade Lake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [
          - {
              - count = 1
              - type  = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/acceleratorTypes/nvidia-a100-80gb"
            },
        ] -> (known after apply)
      ~ id                        = "projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)
      ~ instance_id               = "8604322168578763813" -> (known after apply)
      ~ label_fingerprint         = "4uGUxMjSLYY=" -> (known after apply)
      ~ metadata                  = {
          ~ "ssh-keys"               = "lgsok:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDmsxl77PxYYkWf/KnFDYaHbGNYySVbQg6RrS/QnfzEJwQfP3v4TCO5GzuF8kq5CN44FenBh0Emfkm8MpsGMMLMWtTnP3udnUNGSA10ppyXKhesjqlxOLsLjrD3eoygWF4oAnCVseqpGTeHGwBBL01otKGzZAW9dbC+/ji+IWkovUxLd5qNILvVyoMl3VBN11ztUgjJcuIguHkuVC4FmJtUh5smoXIhHxcPx+ePNWGrYwjyNj3ITcXJtE1EqMAVLGratQJKM1BvX6likoKy6MKJwmje3+6q+FFgRqpCBnaJL2Lu1QJ+WqpDlLxPF/X6+9QnBu1s8hsiZmKdQDr0pawF LDNN19010A\\lgsok@LDNN19010A" -> ""
          + "startup-script"         = <<-EOT
                #!/bin/bash
                set -e
                export DEBIAN_FRONTEND=noninteractive
                
                # Force IPv4 for apt (Cloud NAT doesn't support IPv6)
                echo 'Acquire::ForceIPv4 "true";' > /etc/apt/apt.conf.d/99force-ipv4
                
                # Update system
                apt-get update
                apt-get install -y \
                  apt-transport-https \
                  ca-certificates \
                  curl \
                  gnupg \
                  lsb-release \
                  pciutils \
                  linux-headers-$(uname -r)
                
                # Install NVIDIA drivers for A100 GPU (skip if already working)
                if ! nvidia-smi &> /dev/null; then
                  echo "NVIDIA drivers not loaded, installing/configuring..."
                
                  # Add CUDA repository if not present
                  if [ ! -f /etc/apt/sources.list.d/cuda.list ]; then
                    curl -fsSL https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64/3bf863cc.pub | \
                      gpg --dearmor -o /usr/share/keyrings/cuda-archive-keyring.gpg
                    echo "deb [signed-by=/usr/share/keyrings/cuda-archive-keyring.gpg] https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64 /" > /etc/apt/sources.list.d/cuda.list
                    apt-get update
                  fi
                
                  # Install drivers if not present
                  if ! dpkg -l | grep -q nvidia-driver; then
                    echo "Installing NVIDIA drivers..."
                    apt-get install -y cuda-drivers
                  fi
                
                  # Load the nvidia kernel module if not loaded
                  if ! lsmod | grep -q nvidia; then
                    echo "Loading NVIDIA kernel modules..."
                    modprobe nvidia
                  fi
                else
                  echo "NVIDIA drivers already loaded and working"
                fi
                
                # Install NVIDIA Container Toolkit for Docker GPU support (skip if already installed)
                if ! command -v nvidia-ctk &> /dev/null; then
                  echo "Installing NVIDIA Container Toolkit..."
                  curl -fsSL https://nvidia.github.io/libnvidia-container/gpgkey | \
                    gpg --dearmor -o /usr/share/keyrings/nvidia-container-toolkit-keyring.gpg
                
                  LIST_FILE="/etc/apt/sources.list.d/nvidia-container-toolkit.list"
                  TMP_LIST="$(mktemp)"
                
                  curl -fsSL "https://nvidia.github.io/libnvidia-container/stable/deb/nvidia-container-toolkit.list" \
                    | sed 's#deb https://#deb [signed-by=/usr/share/keyrings/nvidia-container-toolkit-keyring.gpg] https://#g' \
                    > "$TMP_LIST"
                
                  if ! grep -qE '^deb\s' "$TMP_LIST"; then
                    echo "ERROR: NVIDIA repo list download did not look like an apt source list (possible HTML/error page)." >&2
                    head -n 20 "$TMP_LIST" >&2 || true
                    exit 1
                  fi
                
                  mv "$TMP_LIST" "$LIST_FILE"
                  apt-get update
                  apt-get install -y nvidia-container-toolkit
                else
                  echo "NVIDIA Container Toolkit already installed, skipping"
                fi
                
                # Install Docker (skip if already installed)
                if ! command -v docker &> /dev/null; then
                  echo "Installing Docker..."
                  curl -fsSL https://get.docker.com -o get-docker.sh
                  sh get-docker.sh
                else
                  echo "Docker already installed, skipping"
                fi
                
                # Configure Docker to use NVIDIA runtime (idempotent)
                nvidia-ctk runtime configure --runtime=docker
                systemctl restart docker
                
                # Verify GPU is accessible (wait for drivers to load)
                echo "Waiting for GPU drivers to initialize..."
                for i in {1..30}; do
                  if nvidia-smi; then
                    echo "GPU initialized successfully"
                    break
                  fi
                  echo "Waiting for GPU drivers to load... ($i/30)"
                  sleep 2
                done
                
                # Pull and run Ollama with GPU support (skip if already running)
                if ! docker ps | grep -q ollama; then
                  echo "Starting Ollama container..."
                  # Remove stopped container if it exists
                  docker rm -f ollama 2>/dev/null || true
                  docker run -d \
                    --gpus all \
                    --name ollama \
                    --restart always \
                    -p 11434:11434 \
                    -v /var/lib/ollama:/root/.ollama \
                    ollama/ollama
                  # Wait for Ollama to start
                  sleep 15
                else
                  echo "Ollama container already running, skipping"
                fi
                
                # Note: Models will be pulled manually after instance is ready
                # With 1x A100-80GB (80GB VRAM), we can run gpt-oss:120b (65GB)
                echo "Instance ready. Pull model manually:"
                echo "  docker exec ollama ollama pull gpt-oss:120b"
                
                # Log completion
                echo "LLM server with A100 GPU setup completed at $(date)" >> /var/log/llm-setup.log
                echo "GPU Info:" >> /var/log/llm-setup.log
                nvidia-smi >> /var/log/llm-setup.log
            EOT
            # (1 unchanged element hidden)
        }
      ~ metadata_fingerprint      = "OSDrai3er08=" -> (known after apply)
      ~ metadata_startup_script   = <<-EOT # forces replacement
            #!/bin/bash
            set -e
            export DEBIAN_FRONTEND=noninteractive
            
          + # Force IPv4 for apt (Cloud NAT doesn't support IPv6)
          + echo 'Acquire::ForceIPv4 "true";' > /etc/apt/apt.conf.d/99force-ipv4
          + 
            # Update system
            apt-get update
            apt-get install -y \
              apt-transport-https \
              ca-certificates \
              curl \
              gnupg \
              lsb-release \
              pciutils \
              linux-headers-$(uname -r)
            
            # Install NVIDIA drivers for A100 GPU (skip if already working)
            if ! nvidia-smi &> /dev/null; then
              echo "NVIDIA drivers not loaded, installing/configuring..."
            
              # Add CUDA repository if not present
              if [ ! -f /etc/apt/sources.list.d/cuda.list ]; then
                curl -fsSL https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64/3bf863cc.pub | \
                  gpg --dearmor -o /usr/share/keyrings/cuda-archive-keyring.gpg
                echo "deb [signed-by=/usr/share/keyrings/cuda-archive-keyring.gpg] https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64 /" > /etc/apt/sources.list.d/cuda.list
                apt-get update
              fi
            
              # Install drivers if not present
              if ! dpkg -l | grep -q nvidia-driver; then
                echo "Installing NVIDIA drivers..."
                apt-get install -y cuda-drivers
              fi
            
              # Load the nvidia kernel module if not loaded
              if ! lsmod | grep -q nvidia; then
                echo "Loading NVIDIA kernel modules..."
                modprobe nvidia
              fi
            else
              echo "NVIDIA drivers already loaded and working"
            fi
            
            # Install NVIDIA Container Toolkit for Docker GPU support (skip if already installed)
            if ! command -v nvidia-ctk &> /dev/null; then
              echo "Installing NVIDIA Container Toolkit..."
              curl -fsSL https://nvidia.github.io/libnvidia-container/gpgkey | \
                gpg --dearmor -o /usr/share/keyrings/nvidia-container-toolkit-keyring.gpg
            
              LIST_FILE="/etc/apt/sources.list.d/nvidia-container-toolkit.list"
              TMP_LIST="$(mktemp)"
            
              curl -fsSL "https://nvidia.github.io/libnvidia-container/stable/deb/nvidia-container-toolkit.list" \
                | sed 's#deb https://#deb [signed-by=/usr/share/keyrings/nvidia-container-toolkit-keyring.gpg] https://#g' \
                > "$TMP_LIST"
            
              if ! grep -qE '^deb\s' "$TMP_LIST"; then
                echo "ERROR: NVIDIA repo list download did not look like an apt source list (possible HTML/error page)." >&2
                head -n 20 "$TMP_LIST" >&2 || true
                exit 1
              fi
            
              mv "$TMP_LIST" "$LIST_FILE"
              apt-get update
              apt-get install -y nvidia-container-toolkit
            else
              echo "NVIDIA Container Toolkit already installed, skipping"
            fi
            
            # Install Docker (skip if already installed)
            if ! command -v docker &> /dev/null; then
              echo "Installing Docker..."
              curl -fsSL https://get.docker.com -o get-docker.sh
              sh get-docker.sh
            else
              echo "Docker already installed, skipping"
            fi
            
            # Configure Docker to use NVIDIA runtime (idempotent)
            nvidia-ctk runtime configure --runtime=docker
            systemctl restart docker
            
            # Verify GPU is accessible (wait for drivers to load)
            echo "Waiting for GPU drivers to initialize..."
            for i in {1..30}; do
              if nvidia-smi; then
                echo "GPU initialized successfully"
                break
              fi
              echo "Waiting for GPU drivers to load... ($i/30)"
              sleep 2
            done
            
            # Pull and run Ollama with GPU support (skip if already running)
            if ! docker ps | grep -q ollama; then
              echo "Starting Ollama container..."
              # Remove stopped container if it exists
              docker rm -f ollama 2>/dev/null || true
              docker run -d \
                --gpus all \
                --name ollama \
                --restart always \
                -p 11434:11434 \
                -v /var/lib/ollama:/root/.ollama \
                ollama/ollama
              # Wait for Ollama to start
              sleep 15
            else
              echo "Ollama container already running, skipping"
            fi
            
            # Note: Models will be pulled manually after instance is ready
            # With 1x A100-80GB (80GB VRAM), we can run gpt-oss:120b (65GB)
            echo "Instance ready. Pull model manually:"
            echo "  docker exec ollama ollama pull gpt-oss:120b"
            
            # Log completion
            echo "LLM server with A100 GPU setup completed at $(date)" >> /var/log/llm-setup.log
            echo "GPU Info:" >> /var/log/llm-setup.log
            nvidia-smi >> /var/log/llm-setup.log
        EOT
      + min_cpu_platform          = (known after apply)
        name                      = "llm-server-dev"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)
        tags                      = [
            "dev",
            "spot-instance",
        ]
      ~ tags_fingerprint          = "z1mkJj1d5Gg=" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/disks/llm-server-dev" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
                # (3 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/global/networks/default" -> "default"
          ~ network_ip                  = "10.150.0.3" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/regions/us-east4/subnetworks/default" -> (known after apply)
          ~ subnetwork_project          = "local-llm-test-486215" -> (known after apply)
        }

      ~ scheduling {
          - min_node_cpus               = 0 -> null
            # (5 unchanged attributes hidden)
        }

      - scratch_disk { # forces replacement
          - device_name = "local-ssd-0" -> null
          - interface   = "NVME" -> null
          - size        = 375 -> null
        }

      ~ service_account {
          ~ email  = "809219292662-compute@developer.gserviceaccount.com" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ instance_id   = "8604322168578763813" -> (known after apply)
  ~ internal_ip   = "10.150.0.3" -> (known after apply)
  ~ self_link     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Checkov Security Scan:** success



*Pusher: @leonids2005, Action: `pull_request`*